stress/quick-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 5
      arrivalRate: 5
      name: "Warm up"
    # Ramp-up phase
    - duration: 10
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    # Sustained load
    - duration: 15
      arrivalRate: 50
      name: "Sustained load"
    # Spike test
    - duration: 5
      arrivalRate: 100
      name: "Spike test"
    # Cool down
    - duration: 5
      arrivalRate: 10
      name: "Cool down"

  defaults:
    headers:
      Content-Type: "application/json"

  variables:
    testEmail: "loadtest@viva360.com"
    testPassword: "LoadTest123!"

  plugins:
    expect: {}

  # Capture metrics
  ensure:
    maxErrorRate: 5
    p95: 500
    p99: 1000

scenarios:
  # ==========================================
  # HEALTH CHECK SCENARIO
  # ==========================================
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: application/json
            - hasProperty: status

  # ==========================================
  # LOGIN FLOW SCENARIO
  # ==========================================
  - name: "Login Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "ana@viva360.com"
            password: "senha123"
          capture:
            - json: "$.accessToken"
              as: "token"
          expect:
            - statusCode: 200
            - hasProperty: accessToken

      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
            - hasProperty: email

  # ==========================================
  # BROWSE PROFESSIONALS SCENARIO
  # ==========================================
  - name: "Browse Professionals"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "ana@viva360.com"
            password: "senha123"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/professionals"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      - think: 1

      - get:
          url: "/api/search/professionals?minRating=4&limit=10"
          headers:
            Authorization: "Bearer {{ token }}"

  # ==========================================
  # MARKETPLACE BROWSING SCENARIO
  # ==========================================
  - name: "Browse Marketplace"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "ana@viva360.com"
            password: "senha123"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/marketplace"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      - think: 1

      - get:
          url: "/api/search/products?limit=20"
          headers:
            Authorization: "Bearer {{ token }}"

  # ==========================================
  # NOTIFICATIONS SCENARIO
  # ==========================================
  - name: "Check Notifications"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "ana@viva360.com"
            password: "senha123"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/notifications"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200