stress/smoke-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Quick smoke test
    - duration: 10
      arrivalRate: 1
      name: "Smoke test"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Quick API Test"
    flow:
      # Health check
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "ana@viva360.com"
            password: "senha123"
          capture:
            - json: "$.accessToken"
              as: "token"
          expect:
            - statusCode: 200

      # Get current user
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # Get professionals
      - get:
          url: "/api/professionals"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # Get products
      - get:
          url: "/api/marketplace"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # Get notifications
      - get:
          url: "/api/notifications"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200