stress/stress-20k.yml
config:
  target: "http://localhost:3000"
  phases:
    # 1. Warm up - 5s
    - duration: 5
      arrivalRate: 10
      name: "Warm up"
    
    # 2. Ramp to High Load - 30s
    # ramping from 10 to 500 users/sec
    - duration: 30
      arrivalRate: 10
      rampTo: 500
      name: "Ramp up to high load"
      
    # 3. Sustained High Load - 40s
    # 500 users/sec * 40s = 20,000 users approx
    - duration: 40
      arrivalRate: 500
      name: "Sustained heavy load"

  defaults:
    headers:
      Content-Type: "application/json"

  plugins:
    expect: {}

  # Metrics thresholds
  ensure:
    maxErrorRate: 10
    p95: 2000

scenarios:
  # ==========================================
  # CLIENT SCENARIO (60%)
  # - Login
  # - Browse Pros
  # - Search Products
  # ==========================================
  - name: "Client Actions"
    weight: 60
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "ana@viva360.com"
            password: "senha123"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/professionals"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/marketplace?category=Cristais"
          headers:
            Authorization: "Bearer {{ token }}"

  # ==========================================
  # PROFESSIONAL SCENARIO (30%)
  # - Login
  # - Check Notifications
  # - View Appointments (mocked endpoint if needed or just profile)
  # ==========================================
  - name: "Professional Actions"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "luna@viva360.com"
            password: "senha123"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200

      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
      
      - get:
          url: "/api/notifications"
          headers:
            Authorization: "Bearer {{ token }}"

  # ==========================================
  # SPACE SCENARIO (10%)
  # - Login
  # - Check Profile
  # ==========================================
  - name: "Space Actions"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "contato@sanctuarium.com"
            password: "senha123"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200

      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"